-- phpMyAdmin SQL Dump
-- version 5.2.3
-- https://www.phpmyadmin.net/
--
-- Host: db:3306
-- Generation Time: May 08, 2026 at 08:02 AM
-- Server version: 8.0.44
-- PHP Version: 8.3.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `stn_aed`
--

-- --------------------------------------------------------

--
-- Table structure for table `health_facilities`
--

CREATE TABLE `health_facilities` (
  `id` int NOT NULL,
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'ชื่อสถานพยาบาล',
  `typecode` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'ประเภท เช่น รพ.ทั่วไป, รพ.ชุมชน, รพ.สต., ศสช., สสจ, สสอ., สอน.',
  `changwat` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT 'สตูล' COMMENT 'จังหวัด',
  `address` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'ที่อยู่',
  `tambon` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'ตำบล',
  `lat` decimal(10,6) NOT NULL COMMENT 'ละติจูด',
  `lon` decimal(10,6) NOT NULL COMMENT 'ลองจิจูด',
  `district_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'ชื่ออำเภอที่ตั้ง',
  `is_active` tinyint(1) DEFAULT '1' COMMENT 'สถานะการใช้งาน',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='ข้อมูลสถานพยาบาลในจังหวัดสตูล';

--
-- Dumping data for table `health_facilities`
--

INSERT INTO `health_facilities` (`id`, `name`, `typecode`, `changwat`, `address`, `tambon`, `lat`, `lon`, `district_name`, `is_active`, `created_at`, `updated_at`) VALUES
(1, 'รพ.สตูล', 'รพ.ทั่วไป', 'สตูล', '', '', 6.619127, 100.070431, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(2, 'รพ.ควนกาหลง', 'รพ.ชุมชน', 'สตูล', '', '', 6.865899, 99.974614, 'ควนกาหลง', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(3, 'รพ.ควนโดน', 'รพ.ชุมชน', 'สตูล', '', '', 6.776772, 100.095363, 'ควนโดน', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(4, 'รพ.ท่าแพ', 'รพ.ชุมชน', 'สตูล', '', '', 6.788048, 99.970215, 'ท่าแพ', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(5, 'รพ.ทุ่งหว้า', 'รพ.ชุมชน', 'สตูล', '', '', 7.092565, 99.766717, 'ทุ่งหว้า', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(6, 'รพ.มะนัง', 'รพ.ชุมชน', 'สตูล', '', '', 7.005997, 99.917009, 'มะนัง', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(7, 'รพ.ละงู', 'รพ.ชุมชน', 'สตูล', '', '', 6.830630, 99.789470, 'ละงู', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(8, 'รพ.สต.เกาะสาหร่าย', 'รพ.สต.', 'สตูล', '', '', 6.670756, 99.862898, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(9, 'รพ.สต.เกาะหลีเป๊ะ', 'รพ.สต.', 'สตูล', '', '', 6.494608, 99.307546, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(10, 'รพ.สต.ขอนคลาน', 'รพ.สต.', 'สตูล', '', '', 7.007281, 99.683968, 'ทุ่งหว้า', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(11, 'รพ.สต.เขาขาว', 'รพ.สต.', 'สตูล', '', '', 6.913993, 99.823899, 'ละงู', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(12, 'รพ.สต.คลองขุด', 'รพ.สต.', 'สตูล', '', '', 6.673773, 100.112093, 'ควนโดน', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(13, 'รพ.สต.คลองขุด (สาขา)', 'รพ.สต.', 'สตูล', '', '', 6.644430, 100.073960, 'ควนโดน', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(14, 'รพ.สต.ควนกาหลง', 'รพ.สต.', 'สตูล', '', '', 6.841144, 100.071776, 'ควนกาหลง', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(15, 'รพ.สต.ควนขัน', 'รพ.สต.', 'สตูล', '', '', 6.625560, 100.044136, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(16, 'รพ.สต.ควนโดน', 'รพ.สต.', 'สตูล', '', '', 6.786933, 100.080886, 'ควนโดน', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(17, 'รพ.สต.เจ๊ะบิลัง', 'รพ.สต.', 'สตูล', '', '', 6.655063, 99.983961, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(18, 'รพ.สต.ตันหยงโป', 'รพ.สต.', 'สตูล', '', '', 6.595043, 99.959177, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(19, 'รพ.สต.ตำมะลัง', 'รพ.สต.', 'สตูล', '', '', 6.537996, 100.052995, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(20, 'รพ.สต.ท่าเรือ', 'รพ.สต.', 'สตูล', '', '', 6.824829, 99.931860, 'ควนกาหลง', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(21, 'รพ.สต.ทุ่งนุ้ย', 'รพ.สต.', 'สตูล', '', '', 6.857056, 100.110714, 'ควนโดน', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(22, 'รพ.สต.ทุ่งบุหลัง', 'รพ.สต.', 'สตูล', '', '', 7.034680, 99.686530, 'ทุ่งหว้า', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(23, 'รพ.สต.น้ำผุด', 'รพ.สต.', 'สตูล', '', '', 7.023325, 99.847394, 'มะนัง', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(24, 'รพ.สต.บ้านกะทูน-พิปูนล้นเกล้า', 'รพ.สต.', 'สตูล', '', '', 6.896269, 100.018926, 'ควนกาหลง', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(25, 'รพ.สต.บ้านกุบังปะโหลด', 'รพ.สต.', 'สตูล', '', '', 6.743220, 100.100193, 'ควนโดน', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(26, 'รพ.สต.บ้านเกาะยาว  ตำบลปูยู', 'รพ.สต.', 'สตูล', '', '', 6.467061, 100.073379, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(27, 'รพ.สต.บ้านเขาแดง ตำบลป่าแก่บ่อหิน', 'รพ.สต.', 'สตูล', '', '', 7.057724, 99.838397, 'ทุ่งหว้า', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(28, 'รพ.สต.บ้านควน', 'รพ.สต.', 'สตูล', '', '', 6.698670, 100.064454, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(29, 'รพ.สต.บ้านควน ตำบลบ้านควน', 'รพ.สต.', 'สตูล', '', '', 6.702525, 100.066167, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(30, 'รพ.สต.บ้านควนบ่อทอง ตำบลทุ่งนุ้ย', 'รพ.สต.', 'สตูล', '', '', 6.845734, 100.102145, 'ควนโดน', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(31, 'รพ.สต.บ้านคีรีวง ตำบลทุ่งหว้า', 'รพ.สต.', 'สตูล', '', '', 7.092852, 99.809358, 'ทุ่งหว้า', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(32, 'รพ.สต.บ้านฉลุง ตำบลฉลุง', 'รพ.สต.', 'สตูล', '', '', 6.739771, 100.041767, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(33, 'รพ.สต.บ้านตันหยงกลิงตำบลเกาะสาหร่าย', 'รพ.สต.', 'สตูล', '', '', 6.708254, 99.864401, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2026-04-16 09:22:20'),
(34, 'รพ.สต.บ้านตันหยงละไน้ ตำบลแหลมสน', 'รพ.สต.', 'สตูล', '', '', 6.984570, 99.681860, 'ละงู', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(35, 'รพ.สต.บ้านทางยาง ตำบลสาคร', 'รพ.สต.', 'สตูล', '', '', 6.827112, 99.875329, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(36, 'รพ.สต.บ้านทุ่ง ตำบลฉลุง', 'รพ.สต.', 'สตูล', '', '', 6.730415, 100.065216, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(37, 'รพ.สต.บ้านทุ่งดินลุ่ม ตำบลป่าแก่บ่อหิน', 'รพ.สต.', 'สตูล', '', '', 7.056881, 99.801982, 'ทุ่งหว้า', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(38, 'รพ.สต.บ้านทุ่งไหม้  ตำบลน้ำผุด', 'รพ.สต.', 'สตูล', '', '', 6.954817, 99.841027, 'มะนัง', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(39, 'รพ.สต.บ้านนาทอน ตำบลนาทอน', 'รพ.สต.', 'สตูล', '', '', 7.068572, 99.751935, 'ทุ่งหว้า', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(40, 'รพ.สต.บ้านในเมือง ตำบลละงู', 'รพ.สต.', 'สตูล', '', '', 6.950647, 99.792744, 'ละงู', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(41, 'รพ.สต.บ้านบ่อเจ็ดลูก', 'รพ.สต.', 'สตูล', '', '', 6.877568, 99.700002, 'ละงู', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(42, 'รพ.สต.บ้านปาเต๊ะ ตำบลเจ๊ะบิลัง', 'รพ.สต.', 'สตูล', '', '', 6.739658, 99.981690, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(43, 'รพ.สต.บ้านแป-ระใต้', 'รพ.สต.', 'สตูล', '', '', 6.817987, 99.926008, 'ท่าแพ', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(44, 'รพ.สต.บ้านผัง 34  ตำบลอุใดเจริญ', 'รพ.สต.', 'สตูล', '', '', 6.879708, 99.911084, 'ควนกาหลง', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(45, 'รพ.สต.บ้านผัง 50 ตำบลนิคมพัฒนา', 'รพ.สต.', 'สตูล', '', '', 6.941950, 99.885736, 'ควนกาหลง', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(46, 'รพ.สต.บ้านมะนัง ตำบลปาล์มพัฒนา', 'รพ.สต.', 'สตูล', '', '', 7.062887, 99.914517, 'มะนัง', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(47, 'รพ.สต.บ้านวังตง ตำบลนาทอน', 'รพ.สต.', 'สตูล', '', '', 6.985857, 99.751800, 'ทุ่งหว้า', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(48, 'รพ.สต.บ้านวังประจัน ตำบลวังประจัน', 'รพ.สต.', 'สตูล', '', '', 6.757332, 100.145950, 'ควนโดน', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(49, 'รพ.สต.บ้านวังพะเนียด ตำบลเกตรี', 'รพ.สต.', 'สตูล', '', '', 6.679914, 100.097880, 'ควนโดน', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(50, 'รพ.สต.บ้านเหนือคลอง  ตำบลควนกาหลง', 'รพ.สต.', 'สตูล', '', '', 6.995425, 100.022697, 'ควนกาหลง', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(51, 'รพ.สต.บ้านใหม่ ตำบลควนโพธิ์', 'รพ.สต.', 'สตูล', '', '', 6.778163, 100.025347, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(52, 'รพ.สต.ปากน้ำ', 'รพ.สต.', 'สตูล', '', '', 6.847012, 99.760808, 'ละงู', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(53, 'รพ.สต.ปาล์มพัฒนา ', 'รพ.สต.', 'สตูล', '', '', 7.005844, 99.945185, 'มะนัง', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(54, 'รพ.สต.ปูยู', 'รพ.สต.', 'สตูล', '', '', 6.513990, 100.099380, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(55, 'รพ.สต.แป-ระ', 'รพ.สต.', 'สตูล', '', '', 6.839275, 99.922096, 'ท่าแพ', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(56, 'รพ.สต.ย่านซื่อ', 'รพ.สต.', 'สตูล', '', '', 6.757064, 100.069106, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(57, 'รพ.สต.ละงู', 'รพ.สต.', 'สตูล', '', '', 6.830146, 99.789926, 'ละงู', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(58, 'รพ.สต.สาคร', 'รพ.สต.', 'สตูล', '', '', 6.740557, 99.897902, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(59, 'รพ.สต.ห้วยไทร', 'รพ.สต.', 'สตูล', '', '', 6.862600, 99.872230, 'ละงู', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(60, 'รพ.สต.แหลมสน', 'รพ.สต.', 'สตูล', '', '', 6.947910, 99.692131, 'ละงู', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(61, 'รพ.สต.อุใดเจริญ อำเภอควนกาหลง', 'รพ.สต.', 'สตูล', '', '', 6.894013, 99.940586, 'ควนกาหลง', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(62, 'ศสช.กำแพง', 'ศสช.', 'สตูล', '', '', 6.876580, 99.783390, 'ละงู', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(63, 'ศสช.ท่าแพ', 'ศสช.', 'สตูล', '', '', 6.788170, 99.970100, 'ท่าแพ', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(64, 'ศสช.พิมาน', 'ศสช.', 'สตูล', '', '', 6.624400, 100.065280, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(65, 'สสจ.สตูล', 'สสจ.', 'สตูล', '', '', 6.619030, 100.070220, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-22 04:25:21'),
(66, 'สสอ.ควนกาหลง', 'สสอ.', 'สตูล', '', '', 6.856620, 100.032570, 'ควนกาหลง', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(67, 'สสอ.ควนโดน', 'สสอ.', 'สตูล', '', '', 6.787100, 100.077030, 'ควนโดน', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(68, 'สสอ.ท่าแพ', 'สสอ.', 'สตูล', '', '', 6.790310, 99.969360, 'ท่าแพ', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(69, 'สสอ.มะนัง', 'สสอ.', 'สตูล', '', '', 6.973680, 99.917660, 'มะนัง', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(70, 'สสอ.ละงู', 'สสอ.', 'สตูล', '', '', 6.891150, 99.789690, 'ละงู', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(71, 'สสอ.สตูล', 'สสอ.', 'สตูล', '', '', 6.619030, 100.084510, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-22 04:25:14'),
(72, 'สอน.เฉลิมพระเกียรติ', 'สอน.', 'สตูล', '', '', 6.974400, 99.917550, 'มะนัง', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44'),
(73, 'ศสช.ศรีพิมาน', 'ศสช.', 'สตูล', '', '', 6.601774, 100.062040, 'เมืองสตูล', 1, '2025-12-11 02:34:44', '2025-12-11 02:34:44');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `health_facilities`
--
ALTER TABLE `health_facilities`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_typecode` (`typecode`),
  ADD KEY `idx_location` (`lat`,`lon`),
  ADD KEY `idx_district` (`district_name`),
  ADD KEY `idx_active` (`is_active`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `health_facilities`
--
ALTER TABLE `health_facilities`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=74;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
